INSERT INTO public."plans" 
("name", coverage_details, min_age, max_age, sum_insured, premium_amount)
VALUES
-- 1
('Basic Health Plan', 'ค่ารักษาพยาบาลพื้นฐานเหมาจ่ายต่อปี', 18, 30, 50000.00, 1200.00),

-- 2
('Standard Health Plan', 'ความคุ้มครองผู้ป่วยในและผู้ป่วยนอก', 18, 40, 100000.00, 1800.00),

-- 3
('Senior Care Plan', 'แผนครอบคลุมเฉพาะผู้สูงอายุ รวมค่ารักษาโรคเรื้อรัง', 50, 70, 200000.00, 3500.00),

-- 4
('Family Protector', 'คุ้มครองทั้งครอบครัว ค่ารักษา อุบัติเหตุ และชดเชยรายได้', 25, 50, 150000.00, 2700.00),

-- 5
('Accident Shield', 'คุ้มครองอุบัติเหตุสูงสุด พร้อมค่าชดเชยรายได้', 18, 60, 300000.00, 900.00),

-- 6
('Premium Health Plan', 'แผนพรีเมียมคุ้มครองสูง ค่าห้องผู้ป่วยในสูงสุดต่อวัน', 20, 45, 500000.00, 5200.00),

-- 7
('Child Care Plan', 'คุ้มครองเด็กและวัยรุ่น รวมวัคซีนพื้นฐาน', 1, 17, 80000.00, 600.00),

-- 8
('Cancer Protect', 'คุ้มครองมะเร็งระยะเริ่มต้นถึงระยะลุกลาม', 25, 55, 1000000.00, 7500.00),

-- 9
('Maternity Plan', 'คุ้มครองค่าคลอดบุตรและภาวะแทรกซ้อน', 20, 40, 120000.00, 3200.00),

-- 10
('Travel Health Plan', 'คุ้มครองอุบัติเหตุและการรักษาพยาบาลระหว่างเดินทาง', 18, 65, 300000.00, 1500.00);
